EDT/УТ/src/Documents/ВводДанныхПоСтатьямРасчетовСКомитентами/ВводДанныхПоСтатьямРасчетовСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхПоСтатьямРасчетовСКомитентами</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <attributes>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиРасчетов</name>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетов</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/ВзаиморасчетыСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасчетовСКомитентами</name>
    <type>
      <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/ВводДанныхПоСтатьямРасчетовСКомитентами/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Задача № 2540
	ТаблицаДвиженийВзаиморасчетовСКомитентами = РегистрыНакопления.ВзаиморасчетыСКомитентами.ТаблицаДвиженийПоРегистру();
	// Задача № 2540

	// Задача № 2570
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СтатьиРасчетов Цикл
		
		СтрокаДвижения = ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.СтатьяРасчетовСКомитентами = СтрокаТЧ.СтатьяРасчетов;

	КонецЦикла;
	
	Движения.ВзаиморасчетыСКомитентами.СоздатьДвижения(ЭтотОбъект, ТаблицаДвиженийВзаиморасчетовСКомитентами, Ложь);
	// Задача № 2570
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбходПроверок") Тогда
		Возврат;	
	КонецЕсли;
	
	//+++ БАО 13.06.2017 №1024  
	//---Если РейсЗакрыт Тогда
	Если baoВызовСервера.РейсЗакрыт(Ссылка) Тогда
	//--- БАО 13.06.2017 №1024	
		Отказ = Истина;
		#Если Клиент Тогда
			Сообщить("Рейс закрыт");
		#КонецЕсли	
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СтатьиРасчетов.Итог("Сумма");
	
КонецПроцедуры
